{
  "_id": {
    "$oid": "630f8b2f6d7307d7dfeaa798"
  },
  "title": "Interstellar",
  "Description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
  "Genre": {
    "Name": "Adventure",
    "Description": "Adventure is a genre that revolves around the conquests and explorations of a protagonist."
  },
  "Director": {
    "Name": "Christopher Nolan",
    "Bio": "Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970, in London, England. Over the course of 15 years of filmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.",
    "Birth": "1970-07-30",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/uaSYEUugnzE/movieposter_en.jpg",
  "Featured": true
}
{
  "_id": {
    "$oid": "630f9c7b6d7307d7dfeaa799"
  },
  "Title": "Good Will Hunting",
  "Description": "Will Hunting, a janitor from M.I.T., has a gift for mathmatics, but needs help from a psychologist to find direction in his life.",
  "Genre": {
    "Name": "Drama",
    "Description": "Drama is a category or genre of narrative fiction intended to be more serious than humorous in tone."
  },
  "Director": {
    "Name": "Gus Van Sant",
    "Bio": "an American film director, producer, photographer, and musician. He has earned acclaim as both an independent and mainstream filmaker.",
    "Birth": "1952-07-24",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/ReIJ1lbL-Q8/maxresdefault.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fa0046d7307d7dfeaa79a"
  },
  "Title": "Top Gun",
  "Description": "As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.",
  "Genre": {
    "Name": "Action",
    "Description": "A film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."
  },
  "Director": {
    "Name": "Tony Scott",
    "Bio": "Anthony David Leighton Scott was English film director and producer. He was known for directing highly successful action and thriller films such as Top Gun, Beverly Hills Cop II, Days of Thunder, and The Last Boy Scout.",
    "Birth": "1944-06-21",
    "Death": "2012-08-19"
  },
  "ImagePath": "https://i.ytimg.com/vi/3sMdYdZ9xYI/movieposter_en.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fa2766d7307d7dfeaa79b"
  },
  "Title": "Dazed and Confused",
  "Description": "The adventures of high school and junior high school students on the last day of school in may 1976.",
  "Genre": {
    "Name": "Comedy",
    "Description": "a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter."
  },
  "Director": {
    "Name": "Richard Linklater",
    "Bio": "an American film director, producer, and screenwriter. he is known for films that revolve mainly around suburban culture and the effects of the passage of time.",
    "Birth": "1960-07-30",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/TT8GJSqxE3o/movieposter.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fa4706d7307d7dfeaa79c"
  },
  "Title": "Star Wars",
  "Description": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookie and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
  "Genre": {
    "Name": "Sci-Fi",
    "Description": "uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."
  },
  "Director": {
    "Name": "George Lucas",
    "Bio": "George Walton Lucas Jr. is an American film director, producer, screenwriter, and entrepreneur. Lucas is best know for creating Star Wars and Indiana Jones franchises and founding Lucasfilm, LucasArts, and Industrial Light & Magic.",
    "Birth": "1944-05-14",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/yYNSSNJ0z_U/movieposter.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fa6a26d7307d7dfeaa79d"
  },
  "Title": "Hook",
  "Description": "When Captain James Hook kidnaps his children, an adult Peter Pan must return to Neverland to reclaim his youthful spirit in order to challenge his old enemy.",
  "Genre": {
    "Name": "Adventure",
    "Description": "a genre that revolves around the conquest and explorations of a protagonist."
  },
  "Director": {
    "Name": "Steven Spielberg",
    "Bio": "Steven Allan Spielberg is an American film director, producer, and screenwriter. A figure of the new hollywood era, he is the most comercially successful director of all time.",
    "Birth": "1946-12-18",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/BqzG17rxAkw/hqdefault.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fa8d56d7307d7dfeaa79e"
  },
  "Title": "Back to the Future",
  "Description": "Marty McFly, a 17-year old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.",
  "Genre": {
    "Name": "Adventure",
    "Description": "a genre that revolves around the conquest and explorations of a protagonist."
  },
  "Director": {
    "Name": "Robert Zemickis",
    "Bio": "Robert Lee Zemickis is an American filmmaker. He first came to public attention as the director of  the action-adventure romantic comedy Romancing the Stone, The science-fiction comedy Back to the Futre film trilogy, and the live-action/animated comedy Who Framed Roger Rabbit.",
    "Birth": "1951-05-14",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/UpEbGV-mjq0/movieposter.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630faa7e6d7307d7dfeaa79f"
  },
  "Title": "Saving Private Ryan",
  "Description": " Following the Normandy Landings, a group of U.S soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
  "Genre": {
    "Name": "Action",
    "Description": "a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."
  },
  "Director": {
    "Name": "Steven Spielberg",
    "Bio": "Steven Allen Spielberg is an American film director, producer,  and screenwriter. A figure of the new hollywood era, he is the most comercially successful director of all time.",
    "Birth": "1946-12-18",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/hvAL_RMwWfE/movieposter_en.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fabdb6d7307d7dfeaa7a0"
  },
  "Title": "Jurassic Park",
  "Description": "A pragmatic paleontologist touring an almost complete theme park on an island in Central American is tasked with protecting a couple kids after a power failure caused the park' cloned dinosaurs to run loose.",
  "Genre": {
    "Name": "Adventure",
    "Description": " A genre that revolves around the conquest and explorations of a protagonist."
  },
  "Director": {
    "Name": "Steven Spielberg",
    "Bio": "Steven Allen Spielberg is an American film director, producer, and screenwriter. A figure of the new hollywood era, he is the most comercially successful director of all time.",
    "Birth": "1946-12-18",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/D8zlUUrFK-M/hqdefault.jpg",
  "Featured": false
}
{
  "_id": {
    "$oid": "630fadc06d7307d7dfeaa7a1"
  },
  "Title": "Goodfellas",
  "Description": "The Story of Irish-Italian America, Henry Hill, and how he lives day-to-day life as a member of the Mafia. Based on a true story, the plot revolves around Henry and his two unstable friends Jimmy and Tommy as they gradually climb the ladder from petty crime to violent murders.",
  "Genre": {
    "Name": "Crime",
    "Description": "a film genre inspired by and analogous to the crime fiction literary genre."
  },
  "Director": {
    "Name": "Martin Scorsese",
    "Bio": "Martin Charlse Scorsese is an American film director, producer, screenwriter and actor. He is the recipient of many accolades, including and Academy Award, three Primetime Emmy Awards, a Grammy Award, four British Academy Film Awards, three Golden Globe Awards, and two Directors Guild of America Awards.",
    "Birth": "1942-11-17",
    "Death": ""
  },
  "ImagePath": "https://i.ytimg.com/vi/3yWyYhF1Ag0/movieposter_en.jpg",
  "Featured": false
}